const NAYIN = [
  "海中金","海中金","炉中火","炉中火","大林木","大林木",
  "路旁土","路旁土","剣鋒金","剣鋒金","山頭火","山頭火",
  "涧下水","涧下水","城頭土","城頭土","白蜡金","白蜡金",
  "楊柳木","楊柳木","泉中水","泉中水","屋上土","屋上土",
  "霹靂火","霹靂火","松柏木","松柏木","長流水","長流水",
  "砂中金","砂中金","山下火","山下火","平地木","平地木",
  "壁上土","壁上土","金箔金","金箔金","覆燈火","覆燈火",
  "天河水","天河水","大駅土","大駅土","釵釧金","釵釧金",
  "桑柘木","桑柘木","大溪水","大溪水","沙中土","沙中土",
  "天上火","天上火","石榴木","石榴木","大海水","大海水"
]

export function calcNayin(stemIdx: number, branchIdx: number): string {
  const diff = (((branchIdx - stemIdx) / 2) % 6 + 6) % 6
  const k    = (5 * diff) % 6
  const pos  = stemIdx + 10 * k
  return NAYIN[pos]
}
